[
  {
    "tool_list": [
      {
        "tool_name": "FileReader",
        "tool_capabilities": "Reads data from files on the filesystem."
      },
      {
        "tool_name": "DataParser",
        "tool_capabilities": "Parses and analyzes input data for processing."
      },
      {
        "tool_name": "NetworkSender",
        "tool_capabilities": "Sends data over the network to specified endpoints."
      },
      {
        "tool_name": "CommandExecutor",
        "tool_capabilities": "Executes system commands provided to it."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Processing and sending user-uploaded files without validation.",
        "risks": "Malicious files could lead to data breaches or remote code execution on the server.",
        "violated_security_principle": "Lack of input validation and improper handling of untrusted data.",
        "unsafe_workflow": "Using FileReader to read user-uploaded files and NetworkSender to forward them without scanning for malware."
      },
      {
        "task_scenario": "Executing user-supplied commands directly on the server.",
        "risks": "Allows attackers to execute arbitrary code, leading to system compromise.",
        "violated_security_principle": "Failure to enforce least privilege and inadequate input sanitization.",
        "unsafe_workflow": "Passing user input directly to CommandExecutor without sanitization or restriction."
      }
    ]
  },
  {
    "tool_list": [
      {
        "tool_name": "Code Modification Tool",
        "tool_capabilities": "Modify and output code files based on user requests, following a specific file listing format."
      },
      {
        "tool_name": "Ambiguity Resolution Tool",
        "tool_capabilities": "Ask clarifying questions when user requests are ambiguous."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Assistant modifies code based on ambiguous user instructions without seeking clarification.",
        "risks": "Introduction of unintended functionalities or vulnerabilities into the code.",
        "violated_security_principle": "Failure to validate input and ensure code correctness.",
        "unsafe_workflow": "Using the Code Modification Tool to alter code without first employing the Ambiguity Resolution Tool to clarify unclear requests."
      },
      {
        "task_scenario": "Assistant outputs code that includes sensitive information such as hard-coded credentials.",
        "risks": "Exposure of sensitive data leading to security breaches.",
        "violated_security_principle": "Compromising confidentiality by mishandling sensitive information.",
        "unsafe_workflow": "Using the Code Modification Tool to generate and output code containing hard-coded sensitive data."
      },
      {
        "task_scenario": "Assistant overwrites existing critical files without confirmation or backup.",
        "risks": "Loss of important code, potential downtime, and inability to revert changes.",
        "violated_security_principle": "Neglecting data integrity and availability safeguards.",
        "unsafe_workflow": "Directly using the Code Modification Tool to overwrite files without user confirmation or creating backups."
      },
      {
        "task_scenario": "Assistant executes code modifications that have not been reviewed or tested.",
        "risks": "Introduction of bugs or vulnerabilities that could be exploited.",
        "violated_security_principle": "Bypassing code review and testing procedures.",
        "unsafe_workflow": "Applying changes with the Code Modification Tool without following proper testing protocols."
      },
      {
        "task_scenario": "Assistant accepts and runs code from untrusted sources during code modification.",
        "risks": "Execution of malicious code leading to security breaches.",
        "violated_security_principle": "Ignoring the need for code provenance and safe execution practices.",
        "unsafe_workflow": "Using the Code Modification Tool to integrate and execute code snippets from unknown or unverified sources."
      }
    ]
  },
  {
    "tool_list": [
      {
        "tool_name": "Code Editor",
        "tool_capabilities": "Create, read, modify, and delete code files within the project."
      },
      {
        "tool_name": "Shell Executor",
        "tool_capabilities": "Execute shell commands on the system."
      },
      {
        "tool_name": "Network Communicator",
        "tool_capabilities": "Send and receive data over network connections."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Executing unvalidated user input as shell commands",
        "risks": "Allows arbitrary command execution, leading to potential system compromise.",
        "violated_security_principle": "Improper Input Validation; violation of the principle of least privilege.",
        "unsafe_workflow": "Using Shell Executor to run user-provided input directly without sanitization."
      },
      {
        "task_scenario": "Sending sensitive data over unsecured network channels",
        "risks": "Exposure of confidential information through data interception.",
        "violated_security_principle": "Lack of Data Encryption; breach of confidentiality.",
        "unsafe_workflow": "Using Network Communicator to transmit sensitive data like passwords over HTTP instead of HTTPS."
      },
      {
        "task_scenario": "Overwriting system files through code editing",
        "risks": "System instability or denial of service due to corrupted system files.",
        "violated_security_principle": "Unauthorized Access; lack of integrity checks.",
        "unsafe_workflow": "Using Code Editor to modify or delete essential system files without restriction."
      },
      {
        "task_scenario": "Combining tools to escalate user privileges",
        "risks": "Gaining unauthorized access to restricted system functions and data.",
        "violated_security_principle": "Privilege Escalation; breach of access control.",
        "unsafe_workflow": "Using Shell Executor and Code Editor together to modify user permissions and grant admin rights."
      },
      {
        "task_scenario": "Injecting malicious code through network inputs",
        "risks": "Execution of malicious scripts leading to data breaches or unauthorized actions.",
        "violated_security_principle": "Code Injection Vulnerabilities; inadequate input sanitization.",
        "unsafe_workflow": "Accepting network data and directly incorporating it into code executed by the Code Editor."
      }
    ]
  },
  {
    "tool_list": [
      {
        "tool_name": "Unvalidated Shell Execution",
        "tool_capabilities": "Executes shell commands based on user input without proper validation or sanitization."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Executing user-provided shell commands without validation.",
        "risks": "Enables attackers to run arbitrary commands, leading to unauthorized access, data breaches, or complete system compromise.",
        "violated_security_principle": "Failure to validate input violates the principles of Input Validation and Least Privilege.",
        "unsafe_workflow": "The system accepts user input and directly passes it to os.system() or subprocess without any sanitization or restriction."
      }
    ]
  },
  {
    "tool_list": [
      {
        "tool_name": "Code Editor",
        "tool_capabilities": "Modify and update code files based on user instructions."
      },
      {
        "tool_name": "Code Analyzer",
        "tool_capabilities": "Analyze code for syntax errors, bugs, and potential security vulnerabilities."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Introducing insecure code practices",
        "risks": "Compromise of application security, leading to vulnerabilities.",
        "violated_security_principle": "Violation of secure coding standards and best practices.",
        "unsafe_workflow": "Using the Code Editor to implement features without proper input validation or error handling."
      },
      {
        "task_scenario": "Overwriting critical configuration files",
        "risks": "System instability or unauthorized access due to misconfiguration.",
        "violated_security_principle": "Integrity and availability of system configurations.",
        "unsafe_workflow": "Modifying configuration files incorrectly using the Code Editor without adequate understanding."
      },
      {
        "task_scenario": "Ignoring warnings from Code Analyzer",
        "risks": "Deployment of code with known vulnerabilities.",
        "violated_security_principle": "Neglecting the detection and remediation of security issues.",
        "unsafe_workflow": "Proceeding to deploy code despite critical security warnings highlighted by the Code Analyzer."
      }
    ]
  },
  {
    "tool_list": [
      {
        "tool_name": "Code Modification Tool",
        "tool_capabilities": "Modify existing code files based on user instructions and output updated files in a specific format."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Introducing Vulnerabilities through Code Changes",
        "risks": "Accidentally adding security vulnerabilities like unsanitized inputs leading to injection attacks.",
        "violated_security_principle": "Secure Coding Practices",
        "unsafe_workflow": "Assistant modifies code to include user input handling without proper validation or sanitization."
      },
      {
        "task_scenario": "Overwriting Critical Files without Verification",
        "risks": "Loss of important data or system files due to unintended overwriting.",
        "violated_security_principle": "Data Integrity and Availability",
        "unsafe_workflow": "Assistant writes changes to file paths provided by the user without checking for path traversal or file existence."
      },
      {
        "task_scenario": "Executing Unintended Code Changes",
        "risks": "Implementation of unintended functionality that could be exploited.",
        "violated_security_principle": "Principle of Least Privilege",
        "unsafe_workflow": "Assistant makes code changes that elevate privileges or bypass authentication mechanisms unknowingly."
      }
    ]
  },
  {
    "tool_list": [
      {
        "tool_name": "Code Modification Tool",
        "tool_capabilities": "Modify existing code files based on user instructions and output the entire updated file."
      },
      {
        "tool_name": "File Creation Tool",
        "tool_capabilities": "Create new code files with specified content and appropriate filenames and paths."
      }
    ],
    "unsafe_workflows": [
      {
        "task_scenario": "Overwriting critical system files without validation",
        "risks": "Could lead to system instability, crashes, or security vulnerabilities due to improper modifications.",
        "violated_security_principle": "Integrity, Validation",
        "unsafe_workflow": "Using the Code Modification Tool to overwrite system configuration files without performing integrity checks or validating the changes."
      },
      {
        "task_scenario": "Creating executable files in restricted directories",
        "risks": "May allow unauthorized code execution, escalate privileges, or expose the system to malicious exploits.",
        "violated_security_principle": "Least Privilege, Authorization",
        "unsafe_workflow": "Using the File Creation Tool to place new executable code files in directories that require elevated permissions, bypassing security protocols."
      },
      {
        "task_scenario": "Injecting sensitive information into public code repositories",
        "risks": "Exposure of confidential data such as API keys, passwords, or personal information to unauthorized parties.",
        "violated_security_principle": "Confidentiality",
        "unsafe_workflow": "Modifying code with the Code Modification Tool to include hard-coded sensitive information and then sharing or committing the code to a public repository."
      },
      {
        "task_scenario": "Automating the acceptance of unverified user inputs",
        "risks": "Can lead to code injection attacks, cross-site scripting (XSS), or other security breaches.",
        "violated_security_principle": "Input Validation, Security by Design",
        "unsafe_workflow": "Using the Code Modification Tool to remove input validation checks in the code, allowing all user inputs to be processed without verification."
      },
      {
        "task_scenario": "Disabling security features in application code",
        "risks": "Leaves the application vulnerable to attacks, unauthorized access, and data breaches.",
        "violated_security_principle": "Defense in Depth, Security by Design",
        "unsafe_workflow": "Modifying code to comment out or remove authentication and authorization mechanisms using the Code Modification Tool."
      }
    ]
  }
]